Added README.md, modified DEVELOPMENT.md, deleted DESIGN.md
